Repository: StivenArifaj/MediFlow_Flutter
Catalog: lib/l10n/app_*.arb
Languages: sq

# appTagline
source: Your Smart Medicine Companion
sq: Asistenti juaj i ilaçeve

# common_save
source: Save
sq: Ruaj

# common_cancel
source: Cancel
sq: Anulo

# common_delete
source: Delete
sq: Fshi

# common_confirm
source: Confirm
sq: Konfirmo

# common_edit
source: Edit
sq: Redakto

# common_add
source: Add
sq: Shto

# common_back
source: Back
sq: Kthehu

# common_next
source: Next
sq: Tjetra

# common_skip
source: Skip
sq: Kalo

# common_done
source: Done
sq: Përfundo

# common_yes
source: Yes
sq: Po

# common_no
source: No
sq: Jo

# common_error
source: Error
sq: Gabim

# common_success
source: Success
sq: Sukses

# common_loading
source: Loading...
sq: Duke ngarkuar...

# auth_login
source: Log In
sq: Hyr

# auth_register
source: Register
sq: Regjistrohu

# auth_password
source: Password
sq: Fjalëkalimi

# auth_confirmPassword
source: Confirm Password
sq: Konfirmo Fjalëkalimin

# auth_fullName
source: Full Name
sq: Emri i Plotë

# auth_welcomeBack
source: Welcome Back
sq: Mirë se u kthyet

# auth_createAccount
source: Create Account
sq: Krijo Llogari

# auth_alreadyHaveAccount
source: Already have an account? Log In
sq: Keni tashmë një llogari? Hyni

# auth_dontHaveAccount
source: Don't have an account? Register
sq: Nuk keni llogari? Regjistrohuni

# auth_forgotPassword
source: Forgot Password?
sq: Keni harruar fjalëkalimin?

# home_goodMorning
source: Good Morning
sq: Mirëmëngjes

# home_goodAfternoon
source: Good Afternoon
sq: Mirëdita

# home_goodEvening
source: Good Evening
sq: Mirëmbrëma

# home_goodNight
source: Good Night
sq: Natën e mirë

# home_todaysSchedule
source: Today's Schedule
sq: Orari i Sotëm

# home_myMedicines
source: My Medicines
sq: Ilaçet e Mia

# home_seeAll
source: See All
sq: Shiko Të Gjitha

# home_healthTip
source: Health Tip
sq: Këshillë Shëndetësore

# home_medicines
source: Medicines
sq: Ilaçe

# home_today
source: Today
sq: Sot

# home_reminders
source: Reminders
sq: Kujtesat

# medicines_addMedicine
source: Add Medicine
sq: Shto Ilaç

# medicines_scanMedicine
source: Scan Medicine Box
sq: Skano Kutinë e Ilaçit

# medicines_addManually
source: Add Manually
sq: Shto Manualisht

# medicines_medicineName
source: Medicine Name
sq: Emri i Ilaçit

# medicines_brandName
source: Brand Name
sq: Emri i Markës

# medicines_genericName
source: Generic Name
sq: Emri Gjenerik

# medicines_manufacturer
source: Manufacturer
sq: Prodhuesi

# medicines_strength
source: Strength
sq: Forca

# medicines_form
source: Form
sq: Forma

# medicines_quantity
source: Quantity
sq: Sasia

# medicines_expiryDate
source: Expiry Date
sq: Data e Skadimit

# medicines_category
source: Category
sq: Kategoria

# medicines_notes
source: Notes
sq: Shënime

# medicines_setReminder
source: Set Reminder
sq: Vendos Kujtesë

# medicines_editMedicine
source: Edit Medicine
sq: Redakto Ilaçin

# medicines_deleteMedicine
source: Delete Medicine
sq: Fshi Ilaçin

# medicines_noMedicines
source: No medicines added yet
sq: Nuk ka ilaçe të shtuar ende

# reminders_setReminder
source: Set Reminder
sq: Vendos Kujtesë

# reminders_morning
source: Morning
sq: Mëngjes

# reminders_afternoon
source: Afternoon
sq: Pasdite

# reminders_evening
source: Evening
sq: Mbrëmje

# reminders_bedtime
source: Before Bed
sq: Para Fjetjes

# reminders_customTime
source: Custom Time
sq: Kohë e Personalizuar

# reminders_everyDay
source: Every Day
sq: Çdo Ditë

# reminders_specificDays
source: Specific Days
sq: Ditë të Caktuara

# reminders_everyXDays
source: Every X Days
sq: Çdo X Ditë

# reminders_asNeeded
source: As Needed
sq: Sipas Nevojës

# reminders_ongoing
source: Ongoing
sq: Në Vazhdim

# reminders_untilDate
source: Until Specific Date
sq: Deri në Datë të Caktuar

# reminders_forXDays
source: For X Days
sq: Për X Ditë

source: Health Dashboard
sq: Paneli i Shëndetit

# health_trackVitals
source: Track your vital signs
sq: Ndjekni shenjat vitale

# health_addMeasurement
source: Add Measurement
sq: Shto Matje

# health_weight
source: Weight
sq: Pesha

# health_bloodPressure
source: Blood Pressure
sq: Presioni i Gjakut

# health_heartRate
source: Heart Rate
sq: Rrahjet e Zemrës

# health_bloodGlucose
source: Blood Glucose
sq: Glukoza në Gjak

# health_temperature
source: Temperature
sq: Temperatura

# health_steps
source: Steps
sq: Hapa

# health_sleep
source: Sleep
sq: Gjumi

# health_waterIntake
source: Water Intake
sq: Marrja e Ujit

# health_cholesterol
source: Cholesterol
sq: Kolesteroli

# health_waist
source: Waist
sq: Mesi

# health_respiratoryRate
source: Respiratory Rate
sq: Shpejtësia e Frymëmarrjes

# history_title
source: Medication History
sq: Historiku i Ilaçeve

# history_adherence
source: Adherence
sq: Përmbushja

# history_last30Days
source: Last 30 Days
sq: 30 Ditët e Fundit

# history_taken
source: Taken
sq: Marrë

# history_skipped
source: Skipped
sq: Anashkaluar

# history_missed
source: Missed
sq: Harruar

# history_currentStreak
source: Current Streak
sq: Seri Aktuale

# history_days
source: days
sq: ditë

# profile_title
source: Profile
sq: Profili

# profile_settings
source: Settings
sq: Cilësimet

# profile_appearance
source: Appearance
sq: Pamja

# profile_darkMode
source: Dark Mode
sq: Mënyra e Errët

# profile_language
source: Language
sq: Gjuha

# profile_notifications
source: Notifications
sq: Njoftimet

# profile_privacy
source: Privacy & Security
sq: Privatësia dhe Siguria

# profile_dataManagement
source: Data Management
sq: Menaxhimi i të Dhënave

# profile_exportData
source: Export My Data
sq: Eksporto të Dhënat e Mia

# profile_clearData
source: Clear All Data
sq: Fshi Të Gjitha të Dhënat

# profile_logout
source: Logout
sq: Dil

# profile_about
source: About
sq: Rreth

# profile_version
source: Version
sq: Versioni

# role_patient
source: I am a Patient
sq: Unë jam Pacient

# role_caregiver
source: I am a Caregiver
sq: Unë jam Kujdestar

# role_patientDesc
source: I manage my own medicines
sq: Menaxhoj ilaçet e mia

# role_caregiverDesc
source: I help someone else with their medicines
sq: Ndihmoj dikë tjetër me ilaçet e tyre

# role_whoAreYou
source: Who are you?
sq: Kush jeni ju?

# role_helpPersonalize
source: Help us personalize your experience
sq: Na ndihmoni të personalizojmë përvojën tuaj

# role_continue
source: Continue
sq: Vazhdo

# welcome_featureOcr
source: OCR Scan
sq: Skanimi OCR

# welcome_featureReminders
source: Smart Reminders
sq: Kujtesat e Mençura

# welcome_featureMetrics
source: 13 Health Metrics
sq: 13 Metrika Shëndetësore

# welcome_featurePrivate
source: Private & Offline
sq: Privat dhe Offline

# auth_nameRequired
source: Name is required
sq: Emri kërkohet

# auth_emailRequired
source: Email is required
sq: Emaili kërkohet

# auth_passwordRequired
source: Password is required
sq: Fjalëkalimi kërkohet

# auth_passwordMinLength
source: Password must be at least 6 characters
sq: Fjalëkalimi duhet të jetë të paktën 6 karaktere

# auth_passwordMismatch
source: Passwords do not match
sq: Fjalëkalimet nuk përputhen

# auth_emailInvalid
source: Please enter a valid email
sq: Ju lutemi vendosni një email të vlefshëm

# auth_emailAlreadyExists
source: This email is already registered
sq: Ky email është i regjistruar tashmë

# auth_invalidCredentials
source: Invalid email or password
sq: Email ose fjalëkalim i pavlefshëm

# onboarding_trackMedicines
source: Track All Your Medicines
sq: Ndjekni Të Gjitha Ilaçet Tuaja

# onboarding_trackMedicinesDesc
source: Organize every medicine in one place. Never forget a dose again.
sq: Organizoni çdo ilaç në një vend. Mos harroni kurrë një dozë.

# onboarding_smartReminders
source: Smart Reminders
sq: Kujtesat e Mençura

# onboarding_smartRemindersDesc
source: Get personalized notifications at exactly the right time.
sq: Merrni njoftime të personalizuara në kohën e duhur.

# onboarding_monitorHealth
source: Monitor Your Health
sq: Monitoroni Shëndetin Tuaj

# onboarding_monitorHealthDesc
source: Track 13 vital signs and see your adherence improve over time.
sq: Ndjekni 13 shenja vitale dhe shikoni përmbushjen tuaj të përmirësohet me kalimin e kohës.

# onboarding_getStarted
source: Get Started
sq: Filloni

# onboarding_getStartedCta
source: Get Started →
sq: Filloni →

# disclaimer_title
source: Medical Disclaimer
sq: Shënim Mjekësor

# disclaimer_text
source: MediFlow is a medication organization tool only. It does not provide medical advice, diagnosis, or treatment. Always consult your healthcare provider before making any medical decisions.
sq: MediFlow është vetëm një mjet organizimi i ilaçeve. Nuk ofron këshilla mjekësore, diagnozë ose trajtim. Konsultohuni gjithmonë me ofruesin tuaj të shërbimeve shëndetësore para se të merrni çdo vendim mjekësor.

# scan_title
source: Scan Medicine Box
sq: Skano Kutinë e Ilaçit

# scan_alignFrame
source: Align medicine name within the frame
sq: Rreshto emrin e ilaçit brenda kornizës

# scan_manualEntry
source: Manual Entry
sq: Shtim Manual

# scan_processing
source: Analyzing medicine...
sq: Duke analizuar ilaçin...

# scan_noTextDetected
source: Couldn't read this image — try better lighting or Manual Entry
sq: Nuk mund të lexohej kjo imazh — provoni dritë më të mirë ose Shtim Manual
